Terraform Plan Result:

## Terraform Plan Output

```terraform
aws_vpc.demo_vpc_lt_20240622: Refreshing state... [id=vpc-02cdbcf6458c22bcd]
aws_internet_gateway.demo_lt_igw: Refreshing state... [id=igw-0ef9503c36a5e9de6]
aws_security_group.demo_lt_public_sg: Refreshing state... [id=sg-0b5980354bd496a33]
aws_subnet.demo_public_subnet_1a_lt_20240622: Refreshing state... [id=subnet-081eb14d5b9023ec7]
aws_route_table.demo_lt_public_rtb: Refreshing state... [id=rtb-0667f4d07fcba034e]
aws_security_group_rule.demo_lt_public_sg_in_http: Refreshing state... [id=sgrule-1387891202]
aws_route_table_association.demo_lt_public_rtb_ass_a: Refreshing state... [id=rtbassoc-04fd425d5bde64bb0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group_rule.demo_lt_public_sg_in_https will be created
  + resource "aws_security_group_rule" "demo_lt_public_sg_in_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b5980354bd496a33"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```